// === 📚 Задача 0 ===
// Приветствуем 👋! В этом задании контеста вам предстоит опробовать свои
// навыки типизации. В файле представлено 10 задач. Ответ на каждую из них
// нужно дать в виде TypeScript типа!
//
// ⚙️: TypeScript 5.8.3 с включёнными флагами `strict` и `noResolve`
//
// ⚠️: Система автоматически проставит 0 баллов, если в вашем файле будут
// ошибки компиляции! Рекомендуем решать их сразу в IDE 🛠️
//
// 👨‍🏫: Для увеличения интереса (и азарта) мы стараемся не упоминать нужные для
// решения возможности языка *буквально*. Вам помогут поисковик и переводчик.
// Для некоторых заданий есть подсказки 💡

// В задаче под номером 0 вы знакомитесь с системой. Чтобы получить балл,
// измените тип `WelcomeToContest` с `any` на `'hi!'`

type WelcomeToContest = "hi!";
// Решение:
// type WelcomeToContest = 'hi!'

// === 📚 Задача 1 ===
// Давайте представим, что вы разрабатываете прототип игры на TypeScript. Вы
// планируете добавить в игру множество разных артефактов, которые будут
// по-разному влиять на игрока.

type Artifact = {
  id: "HEALTH_UP" | "DAMAGE_UP" | "SPEED_UP"; // | ✨
  // Внимание, магия (✨) контеста! При проверке задачи тип `Artifact` будет
  // отличаться - в него добавится больше вариантов `id`! Ваш код должен
  // работать не только на ваших данных, но и на неизвестных!
};

// 🎯 Цель: объявите функцию artifactDropRate, которая принимает идентификатор
// артефакта и возвращает число. Допустим, что она возвращает число выдаваемых
// игроку артефактов
declare function artifactDropRate(id: Artifact["id"]): number;

// ✨: Помните, что Artifact в проверке контеста будет отличаться! В
// следующем обновлении игры другая команда разработчиков добавит новые виды
// артефактов - сделайте функцию устойчивой к изменениям 👨‍🔬

// 💡: Найдите способ "пробраться внутрь" типа объекта

// === 📚 Задача 2 ===
// Спустя короткое время вы поняли, что определять все виды артефактов в одном
// типе достаточно неудобно для параллельной работы команды. На встрече вы
// набросали такие типы для каждого артефакта:

type HealthUpArtifact = { id: "HEALTH_UP"; affectsStat: "health" };
type DamageUpArtifact = { id: "DAMAGE_UP"; affectsStat: "damage" };
type SpeedUpArtifact = { id: "SPEED_UP"; affectsStat: "speed" };
// type ✨ = ...

type StatArtifact = HealthUpArtifact | DamageUpArtifact | SpeedUpArtifact; // | ✨

// 🎯 Цель: напишите тип `HeroStat`, который автоматически выведет множество
// всех возможных характеристик из StatArtifact
type HeroStat = StatArtifact["affectsStat"];

// 💡: Эта задача очень похожа на предыдущую!

// === 📚 Задача 3 ===
// За несколько недель ваша команда успешно разработала рабочий прототип игры, и
// вы отдали его тестировщикам. Главная жалоба игравших - выпадает слишком много
// активных предметов! Вам нужно усложнить функцию для подсчёта вероятности
// выпадения

// Коллега принёс вам такие примеры типов артефактов:

type BoostArtifact = { id: "BOOST"; interaction: "active" };
type CritChanceArtifact = { id: "CRIT_CHANCE"; interaction: "passive" };
type StealthArtifact = { id: "STEALTH"; interaction: "active" };
type WallClimbArtifact = { id: "WALL_CLIMB"; interaction: "passive" };
// type ✨ = ...

type InteractableArtifact =
  | BoostArtifact
  | CritChanceArtifact
  | StealthArtifact
  | WallClimbArtifact;
//  | ✨

// 🎯 Цель: объявить функцию `balancedArtifactDropRate`, которая принимает ID
// *активного* артефакта из множества `InteractableArtifact` и возвращает число
// выдаваемых игроку артефактов. Артефакт считается активным, если его поле
// `interaction` равно `'active'`.
declare function balancedArtifactDropRate(
  id: Extract<InteractableArtifact, { interaction: "active" }>["id"],
): number;

// 👨‍🏫: Например, функция должна принять "BOOST", но не принять "WALL_CLIMB" - и
// так для любого артефакта из множества `InteractableArtifact` (которым вы не
// управляете - ✨)

// 💡: В TypeScript есть набор встроенных типов - изучите их! Так вы найдёте
// инструмент, который поможет вам "отфильтровать" `InteractableArtifact`

// === 📚 Задача 4 ===
// Параллельно с вами над игрой работает ещё одна команда разработчиков - они
// занимаются портированием на мобильные устройства. Вы отозвались помочь
// коллегам, и вам предстоит использовать их SDK для реализации новой фичи.
// Разработчики поделились с вами частью своей документации:

type MobileSDK = {
  showNotification: (message: string) => Promise<void>;
  rumble: (amount: number) => Promise<void>;
  accelerationX: number;
  // ✨
};

// `MobileSDK` реализован где-то в слое нативного приложения. Через окно отладки
// коллега показал вам, что доступ к SDK осуществляется через `window.mobileSDK`

// 🎯 Цель: дополните `window` так, чтобы в нём было доступно поле `mobileSDK`
interface Window {
  mobileSDK?: MobileSDK;
}
// 🚧: Поле должно быть необязательным, поскольку игру планируют запускать и на
// настольных компьютерах. Разработчики будут использовать такую проверку:

function optionalMobileSdk() {
  if ("mobileSDK" in window) {
    // ... Чтобы проверить, что `mobileSDK` сейчас есть в `window`
  }
}

// 💡: С помощью редактора кода посмотрите, как объявлен `window`

// 👨‍🏫: Для решения задачи не нужно применять механизмы модулей

// === 📚 Задача 5 ===
// Последние месяцы вы активно работали над началом и серединой игры, и теперь
// решили добавить дополнительные цели для заинтересованных игроков -
// достижения 🥇!

// Вам дан объект, в котором ключи - это идентификаторы достижений, а значения -
// прогресс их выполнения в процентах 🧮

type AchievementProgress = Record<
  | "LoreCollector"
  | "TreasureHoarder"
  | "PuzzleMastermind"
  | "ZeroDeaths"
  | "GlitchHunter", // | ✨
  number
>;

// Вы разрабатываете класс меню, которое рисует на canvas полоски прогресса
// выполнения достижений. Основную работу выполняет метод `drawProgressBar`:

declare class AchievementProgressMenu {
  /**
   * Рисует полоску выполнения одного достижения на холст
   * @param topLeft координаты полоски на холсте
   * @param achievement идентификатор достижения
   */
  drawProgressBar(
    topLeft: [x: number, y: number],
    achievement: keyof AchievementProgress,
  ): void;
}

// 🎯 Цель: доработайте декларацию метода `drawProgressBar` так, чтобы в
// параметре achievement он принимал только идентификаторы достижений из
// `AchievementProgress`

// 💡: Посмотрите, как в обычном JavaScript можно получить ключи объекта

// === 📚 Задача 6 ===
// В вашей игре у разных персонажей есть довольно много характеристик:
// здоровье, скорость, сила, ловкость... В коде они представлены в виде
// *брендированных чисел*:

type HealthPoints = number & { unit: "hp" };
type DamagePoints = number & { unit: "damage" };
type MoveSpeed = number & { unit: "m/s" };
// type ✨ = ...

// ⏸️: Можете сделать перерыв и изучить функцию `calculateMoveSpeed`. Она не
// нужна для решения задачи - это просто пример брендированных чисел

const BASE_PLAYER_SPEED = 4 as MoveSpeed;

function calculateMoveSpeed(hp: HealthPoints): MoveSpeed {
  if (hp >= 5) {
    return BASE_PLAYER_SPEED;
  }

  // @ts-expect-error 🚧 функция должна возвращать `MoveSpeed`, но в этой
  // формуле мы смешиваем `MoveSpeed` и `HealthPoints`! "Брендированные
  // числа" помогают отслеживать единицы измерения
  return BASE_PLAYER_SPEED * (hp / 5);
}

// ▶️: Продолжим. От коллеги-геймдизайнера появилась прикладная задача: вам
// нужно уметь ограничивать разные характеристики игрока, чтобы он не мог
// накопить слишком много здоровья, урона и других способностей.
//
// Напрашивается такое объявление функции `clampUnit`:

declare function clampUnit<T>(currentValue: T, maxValue: number): T;

// ...но в нём есть проблема. Если передать в функцию `DamagePoints` - на
// выходе получится просто `number`. Получается, что при вызове функции вам
// каждый раз придётся заново уточнять её результат с помощью оператора `as`

function clampSpeedExample(playerSpeed: MoveSpeed): MoveSpeed {
  //   // @ts-expect-error 🚧 `clampUnit` должен вернуть `MoveSpeed`, но
  // возвращает `number` из-за своей декларации
  const speed: MoveSpeed = clampUnit(playerSpeed, 9);
  return speed;
}

// 🎯 Цель: доработайте декларацию функции `clampUnit` так, чтобы она принимала
// *какой-то* тип в аргументе `currentValue`, и на выходе получалось значение
// *того же* типа. `maxValue` оставьте простым числом.

// 👨‍🏫: Пока не беспокойтесь о том, что в `clampUnit` можно будет передать даже
// что-то совсем не похожее на `number` - про этот механизм TypeScript будет
// другая задача.

// 💡: Вам нужно сделать функцию *обобщённой* для любых видов данных

// === 📚 Задача 7 ===
// Среди отзывов и просьб первых игроков часто встречалась жалоба на малый
// размер инвентаря - игрок хочет взять несколько артефактов, но на них не
// хватает места.
//
// У дизайнеров появилась идея "смешанных" артефактов. В коде вашей игры это
// должно выглядеть примерно так:
// должно выглядеть примерно так:

type NinjaArtifact = {
  id: "MIXED";
  components: ["BOOST", "STEALTH"];
};

// ...но есть проблема. При всём желании вы и ваши коллеги не смогут объявить
// все возможные комбинации артефактов. Вам нужно придумать *общий* тип,
// который будет смешивать два артефакта в один `"MIXED"`.

type MixedArtifact<
  X extends Artifact | { id: "MIXED" },
  Y extends Artifact | { id: "MIXED" },
> = X["id"] extends "MIXED"
  ? CheeseArtifact
  : Y["id"] extends "MIXED"
  ? CheeseArtifact
  : {
      id: "MIXED";
      components: [X["id"], Y["id"]];
    };

// 🎯 Цель: доработайте объявление типа `MixedArtifact` так, чтобы он принимал
// 2 других артефакта (`Artifact`!) и помещал их идентификаторы в поле
// `components` (в том же порядке, в котором ему передали).

// 💡: Начните путать слова "тип" и "функция"! Да, специально! Совет звучит
// странно, но в этом есть доля правды.

// 🚧 Обратите внимание - принимать нужно именно `Artifact`! Контест проверит,
// что на другие данные ваш тип выдаст ошибку компиляции

// === 📚 Задача 8 ===
// Вечером одной славной пятницы ваш коллега принёс неприятную весть. В глубине
// души вы чувствовали подвох ещё в предыдущей задаче, но теперь эта проблема
// стала критичной...
//
// Игроки могут смешивать *уже смешанные* артефакты! Это ломает баланс игры, и
// вам нужно его восстановить.

// 🎯 Цель: доработайте ваш тип `MixedArtifact` из предыдущей задачи так, чтобы
// при попытке добавить в смесь хотя бы один артефакт `"MIXED"` на выходе
// получался `CheeseArtifact`

type CheeseArtifact = { id: "CHEESE" }; // 🧀

// 💡: Прошлая подсказка про функции была неспроста! Теперь ваши типы должны
// уметь принимать решения 🧠

// === 🚧 Следующие задачи нужно решать по очереди! ===

// === 📚 Задача 9 ===
// В вашей игре есть система уровней сложности: в настройке игрок выбирает
// начальный уровень испытания, а затем он плавно поднимается по некоторым
// правилам. Вам дано множество `Difficulty`

type Difficulty = "peaceful" | "easy" | "normal" | "hard" | "impossible";
//   ^ 🔒 При проверке тип будет строго таким!

// 🎯 Цель: реализуйте тип `IncreasedDifficulty`, который принимает один
// вариант `Difficulty` и возвращает сложность на уровень выше! На вход
// `'normal'` нужно отдать `'hard'` и так далее. На вход `'impossible'` стоит
// оставить сложность на том же уровне.

type NextDifficulty = {
  peaceful: "easy";
  easy: "normal";
  normal: "hard";
  hard: "impossible";
  impossible: "impossible";
};

type IncreasedDifficulty<T extends Difficulty> = NextDifficulty[T];

// 🚧: `IncreasedDifficulty` должен принимать только `Difficulty` - на обычную
// строку и другие данные тип должен отдать ошибку компиляции.

// 💡: Задачу можно решить методом принятия решений из прошлой задачи (🧠), но
// мы советуем вам поискать более простой способ. Попробуйте сделать "таблицу
// перехода" для разных уровней сложности 🧮

// 👨‍🏫: Вспомните самую первую задачу!

// === 📚 Задача 10 ===
// В честь 31 октября 🎃 в вашу игру хотят добавить *тёмные* артефакты! Они
// добавляют игроку те же способности, но взамен увеличивают сложность игры на
// какое-то время.
//
// Артефакт считается тёмным, если у него есть поле `isDark`, равное `true`:

type RegularDamageUp = { id: "DAMAGE_UP" };
type DarkDamageUp = { id: "DAMAGE_UP"; isDark: true };

// Теперь представьте, что у вас есть тип игрока:

type EvilNinjaPlayer = {
  artifacts: [HealthUpArtifact, NinjaArtifact, DarkDamageUp];
};

// У `EvilNinjaPlayer` есть один тёмный артефакт. Значит, если текущая базовая
// сложность игры `'normal'`, то для `EvilNinjaPlayer` она поднимется до
// `'hard'`. А если он подберёт ещё один тёмный артефакт - до `'impossible'`

// 🎯 Цель: реализуйте тип `TotalDifficulty`, который:
// 1) в первом параметре принимает массив артефактов `Artifact`
// 2) во втором параметре - начальный уровень сложности `Difficulty`
// 3) возвращает итоговый уровень, до которого нужно поднять сложность игры

type TotalDifficulty<
    Artifacts extends readonly Artifact[],
    Current extends Difficulty
> =  Artifacts extends readonly [
    infer Head extends Artifact,
    ...infer Tail extends Artifact[],
  ]
    ? Head extends { isDark: true }
      ? TotalDifficulty<
          Tail,
          IncreasedDifficulty<Current>
        >
      : TotalDifficulty<Tail, Current>
    : Current;

// 🤯: Эта задача значительно сложнее предыдущих. Она не отражает каждодневные
// варианты использования TypeScript, поэтому она необязательная 👌

// 💡: "Выведение типов", "рекурсия", "кортежи". Она правда сложная...

// 💪: Зато это настоящий челлендж! Почувствуйте себя настоящим волшебником
// типизации! Магистром compile-time! 🧙

// 👨‍🏫: А если серьёзно, эти знания могут пригодиться авторам сложных библиотек.
// Развлекайтесь! Успехов 🍀

// ====== 📖 Материалы для самообучения ======
// https://github.com/type-challenges/type-challenges?tab=readme-ov-file
// https://www.youtube.com/playlist?list=PLIvujZeVDLMx040-j1W4WFs1BxuTGdI_b
// https://www.youtube.com/playlist?list=PL_L_J_Lv0U2owwNFXCoAy3BFPntY2Ry8_
// https://typehero.dev
